NextFOAM-2401/tutorials/incompressible/pimpleFoam/laminar/contaminatedDroplet2D/0.orig/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

referenceLevel  0;

boundaryField
{
    freeSurface
    {
        type            fixedGradient;
        gradient        $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
